//SSDT.c

//#include <ntifs.h>
#include <ntddk.h>
#include <ntstatus.h>
#include <wdm.h>
#include <ntstrsafe.h>
#include <windef.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include "tdiinfo.h"
#include "ssdt.h"

extern PMYSSDT    KeServiceDescriptorTable;
/*  Server 2003 Wrk 

nt!PEPROCESS
Ptr32    +0x000 Pcb              : _KPROCESS
   +0x078 ProcessLock      : _EX_PUSH_LOCK
   +0x080 CreateTime       : _LARGE_INTEGER
   +0x088 ExitTime         : _LARGE_INTEGER
   +0x090 RundownProtect   : _EX_RUNDOWN_REF
   +0x094 UniqueProcessId  : Ptr32 Void
   +0x098 ActiveProcessLinks : _LIST_ENTRY
   +0x0a0 QuotaUsage       : [3] Uint4B
   +0x0ac QuotaPeak        : [3] Uint4B
   +0x0b8 CommitCharge     : Uint4B
   +0x0bc PeakVirtualSize  : Uint4B
   +0x0c0 VirtualSize      : Uint4B
   +0x0c4 SessionProcessLinks : _LIST_ENTRY
   +0x0cc DebugPort        : Ptr32 Void
   +0x0d0 ExceptionPort    : Ptr32 Void
   +0x0d4 ObjectTable      : Ptr32 _HANDLE_TABLE
   +0x0d8 Token            : _EX_FAST_REF
   +0x0dc WorkingSetPage   : Uint4B
   +0x0e0 AddressCreationLock : _KGUARDED_MUTEX
   +0x100 HyperSpaceLock   : Uint4B
   +0x104 ForkInProgress   : Ptr32 _ETHREAD
   +0x108 HardwareTrigger  : Uint4B
   +0x10c PhysicalVadRoot  : Ptr32 _MM_AVL_TABLE
   +0x110 CloneRoot        : Ptr32 Void
   +0x114 NumberOfPrivatePages : Uint4B
   +0x118 NumberOfLockedPages : Uint4B
   +0x11c Win32Process     : Ptr32 Void
   +0x120 Job              : Ptr32 _EJOB
   +0x124 SectionObject    : Ptr32 Void
   +0x128 SectionBaseAddress : Ptr32 Void
   +0x12c QuotaBlock       : Ptr32 _EPROCESS_QUOTA_BLOCK
   +0x130 WorkingSetWatch  : Ptr32 _PAGEFAULT_HISTORY
   +0x134 Win32WindowStation : Ptr32 Void
   +0x138 InheritedFromUniqueProcessId : Ptr32 Void
   +0x13c LdtInformation   : Ptr32 Void
   +0x140 VadFreeHint      : Ptr32 Void
   +0x144 VdmObjects       : Ptr32 Void
   +0x148 DeviceMap        : Ptr32 Void
   +0x14c Spare0           : [3] Ptr32 Void
   +0x158 PageDirectoryPte : _HARDWARE_PTE_X86
   +0x158 Filler           : Uint8B
   +0x160 Session          : Ptr32 Void
   +0x164 ImageFileName    : [16] UChar
   +0x174 JobLinks         : _LIST_ENTRY
   +0x17c LockedPagesList  : Ptr32 Void
   +0x180 ThreadListHead   : _LIST_ENTRY
   +0x188 SecurityPort     : Ptr32 Void
   +0x18c PaeTop           : Ptr32 Void
   +0x190 ActiveThreads    : Uint4B
   +0x194 GrantedAccess    : Uint4B
   +0x198 DefaultHardErrorProcessing : Uint4B
   +0x19c LastThreadExitStatus : Int4B
   +0x1a0 Peb              : Ptr32 _PEB
   +0x1a4 PrefetchTrace    : _EX_FAST_REF
   +0x1a8 ReadOperationCount : _LARGE_INTEGER
   +0x1b0 WriteOperationCount : _LARGE_INTEGER
   +0x1b8 OtherOperationCount : _LARGE_INTEGER
   +0x1c0 ReadTransferCount : _LARGE_INTEGER
   +0x1c8 WriteTransferCount : _LARGE_INTEGER
   +0x1d0 OtherTransferCount : _LARGE_INTEGER
   +0x1d8 CommitChargeLimit : Uint4B
   +0x1dc CommitChargePeak : Uint4B
   +0x1e0 AweInfo          : Ptr32 Void
   +0x1e4 SeAuditProcessCreationInfo : _SE_AUDIT_PROCESS_CREATION_INFO
   +0x1e8 Vm               : _MMSUPPORT
   +0x230 MmProcessLinks   : _LIST_ENTRY
   +0x238 ModifiedPageCount : Uint4B
   +0x23c JobStatus        : Uint4B
   +0x240 Flags            : Uint4B
   +0x240 CreateReported   : Pos 0, 1 Bit
   +0x240 NoDebugInherit   : Pos 1, 1 Bit
   +0x240 ProcessExiting   : Pos 2, 1 Bit
   +0x240 ProcessDelete    : Pos 3, 1 Bit
   +0x240 Wow64SplitPages  : Pos 4, 1 Bit
   +0x240 VmDeleted        : Pos 5, 1 Bit
   +0x240 OutswapEnabled   : Pos 6, 1 Bit
   +0x240 Outswapped       : Pos 7, 1 Bit
   +0x240 ForkFailed       : Pos 8, 1 Bit
   +0x240 Wow64VaSpace4Gb  : Pos 9, 1 Bit
   +0x240 AddressSpaceInitialized : Pos 10, 2 Bits
   +0x240 SetTimerResolution : Pos 12, 1 Bit
   +0x240 BreakOnTermination : Pos 13, 1 Bit
   +0x240 SessionCreationUnderway : Pos 14, 1 Bit
   +0x240 WriteWatch       : Pos 15, 1 Bit
   +0x240 ProcessInSession : Pos 16, 1 Bit
   +0x240 OverrideAddressSpace : Pos 17, 1 Bit
   +0x240 HasAddressSpace  : Pos 18, 1 Bit
   +0x240 LaunchPrefetched : Pos 19, 1 Bit
   +0x240 InjectInpageErrors : Pos 20, 1 Bit
   +0x240 VmTopDown        : Pos 21, 1 Bit
   +0x240 ImageNotifyDone  : Pos 22, 1 Bit
   +0x240 PdeUpdateNeeded  : Pos 23, 1 Bit
   +0x240 VdmAllowed       : Pos 24, 1 Bit
   +0x240 SmapAllowed      : Pos 25, 1 Bit
   +0x240 CreateFailed     : Pos 26, 1 Bit
   +0x240 DefaultIoPriority : Pos 27, 3 Bits
   +0x240 Spare1           : Pos 30, 1 Bit
   +0x240 Spare2           : Pos 31, 1 Bit
   +0x244 ExitStatus       : Int4B
   +0x248 NextPageColor    : Uint2B
   +0x24a SubSystemMinorVersion : UChar
   +0x24b SubSystemMajorVersion : UChar
   +0x24a SubSystemVersion : Uint2B
   +0x24c PriorityClass    : UChar
   +0x250 VadRoot          : _MM_AVL_TABLE
   +0x270 Cookie           : Uint4B

*/

/*
nt!PETHREAD
Ptr32    +0x000 Tcb              : _KTHREAD
   +0x1b8 CreateTime       : _LARGE_INTEGER
   +0x1c0 ExitTime         : _LARGE_INTEGER
   +0x1c0 LpcReplyChain    : _LIST_ENTRY
   +0x1c0 KeyedWaitChain   : _LIST_ENTRY
   +0x1c8 ExitStatus       : Int4B
   +0x1c8 OfsChain         : Ptr32 Void
   +0x1cc PostBlockList    : _LIST_ENTRY
   +0x1d4 TerminationPort  : Ptr32 _TERMINATION_PORT
   +0x1d4 ReaperLink       : Ptr32 _ETHREAD
   +0x1d4 KeyedWaitValue   : Ptr32 Void
   +0x1d8 ActiveTimerListLock : Uint4B
   +0x1dc ActiveTimerListHead : _LIST_ENTRY
   +0x1e4 Cid              : _CLIENT_ID
   +0x1ec LpcReplySemaphore : _KSEMAPHORE
   +0x1ec KeyedWaitSemaphore : _KSEMAPHORE
   +0x200 LpcReplyMessage  : Ptr32 Void
   +0x200 LpcWaitingOnPort : Ptr32 Void
   +0x204 ImpersonationInfo : Ptr32 _PS_IMPERSONATION_INFORMATION
   +0x208 IrpList          : _LIST_ENTRY
   +0x210 TopLevelIrp      : Uint4B
   +0x214 DeviceToVerify   : Ptr32 _DEVICE_OBJECT
   +0x218 ThreadsProcess   : Ptr32 _EPROCESS
   +0x21c StartAddress     : Ptr32 Void
   +0x220 Win32StartAddress : Ptr32 Void
   +0x220 LpcReceivedMessageId : Uint4B
   +0x224 ThreadListEntry  : _LIST_ENTRY
   +0x22c RundownProtect   : _EX_RUNDOWN_REF
   +0x230 ThreadLock       : _EX_PUSH_LOCK
   +0x234 LpcReplyMessageId : Uint4B
   +0x238 ReadClusterSize  : Uint4B
   +0x23c GrantedAccess    : Uint4B
   +0x240 CrossThreadFlags : Uint4B
   +0x240 Terminated       : Pos 0, 1 Bit
   +0x240 DeadThread       : Pos 1, 1 Bit
   +0x240 HideFromDebugger : Pos 2, 1 Bit
   +0x240 ActiveImpersonationInfo : Pos 3, 1 Bit
   +0x240 SystemThread     : Pos 4, 1 Bit
   +0x240 HardErrorsAreDisabled : Pos 5, 1 Bit
   +0x240 BreakOnTermination : Pos 6, 1 Bit
   +0x240 SkipCreationMsg  : Pos 7, 1 Bit
   +0x240 SkipTerminationMsg : Pos 8, 1 Bit
   +0x244 SameThreadPassiveFlags : Uint4B
   +0x244 ActiveExWorker   : Pos 0, 1 Bit
   +0x244 ExWorkerCanWaitUser : Pos 1, 1 Bit
   +0x244 MemoryMaker      : Pos 2, 1 Bit
   +0x244 KeyedEventInUse  : Pos 3, 1 Bit
   +0x248 SameThreadApcFlags : Uint4B
   +0x248 LpcReceivedMsgIdValid : Pos 0, 1 Bit
   +0x248 LpcExitThreadCalled : Pos 1, 1 Bit
   +0x248 AddressSpaceOwner : Pos 2, 1 Bit
   +0x248 OwnsProcessWorkingSetExclusive : Pos 3, 1 Bit
   +0x248 OwnsProcessWorkingSetShared : Pos 4, 1 Bit
   +0x248 OwnsSystemWorkingSetExclusive : Pos 5, 1 Bit
   +0x248 OwnsSystemWorkingSetShared : Pos 6, 1 Bit
   +0x248 OwnsSessionWorkingSetExclusive : Pos 7, 1 Bit
   +0x249 OwnsSessionWorkingSetShared : Pos 0, 1 Bit
   +0x249 ApcNeeded        : Pos 1, 1 Bit
   +0x24c ForwardClusterOnly : UChar
   +0x24d DisablePageFaultClustering : UChar
   +0x24e ActiveFaultCount : UChar

*/

//#define SystemHandleInformation  16
#define TCPUDP_FLAG   100
#define WIN2K_SOCKET_FLAG  0x1a //2k
#define WINXP_SOCKET_FLAG  0x1c //xp
#define WIN2K3_SOCKET_FLAG  0x1a //2k3
#define WIN2K_EPROCESS_NAMEOFFSET    0x1fc //2k
#define WINXP_EPROCESS_NAMEOFFSET    0x174 //xp
#define WIN2K3_EPROCESS_NAMEOFFSET   0x1fc //2k3

///////////////////////////不同的windows版本下面的偏移值不同
#define  EPROCESS_SIZE       0x274 //EPROCESS结构大小

#define  PEB_OFFSET          0x1A0    //Peb
#define  FILE_NAME_OFFSET    0x164    //ImageFileName
#define  PROCESS_LINK_OFFSET 0x098    //ActiveProcessLinks
#define  PROCESS_ID_OFFSET   0x094    //UniqueProcessId
#define  EXIT_TIME_OFFSET    0x088    //ExitTime

#define  OBJECT_HEADER_SIZE  0x018
#define  OBJECT_TYPE_OFFSET  0x008

#define PDE_INVALID 2 
#define PTE_INVALID 1 
#define VALID 0 
ULONG     pebAddress;         //PEB地址的前半部分
PEPROCESS pSystem;            //system进程
ULONG     pObjectTypeProcess; //进程对象类型

